## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 10 to add, 0 to change, 12 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                 |
|--------|---------------------------------------------------------------------|
| add    | `aws_ssm_parameter.superset_secret_key`                             |
|        | `module.superset_ecs.aws_cloudwatch_log_group.this`                 |
|        | `module.superset_ecs.aws_ecs_cluster.this[0]`                       |
|        | `module.superset_ecs.aws_ecs_cluster_capacity_providers.this[0]`    |
|        | `module.superset_ecs.aws_ecs_service.this`                          |
|        | `module.superset_ecs.aws_ecs_task_definition.this`                  |
|        | `module.superset_ecs.aws_iam_policy.this_task_exec`                 |
|        | `module.superset_ecs.aws_iam_role.this_task`                        |
|        | `module.superset_ecs.aws_iam_role.this_task_exec`                   |
|        | `module.superset_ecs.aws_iam_role_policy_attachment.this_task_exec` |
| delete | `aws_cloudwatch_log_group.superset`                                 |
|        | `aws_ecs_cluster.superset`                                          |
|        | `aws_ecs_service.superset_image`                                    |
|        | `aws_ecs_task_definition.superset_image`                            |
|        | `aws_iam_policy.superset_task_execution_policy`                     |
|        | `aws_iam_role.superset_task_execution_role`                         |
|        | `aws_iam_role.superset_task_role`                                   |
|        | `aws_iam_role_policy_attachment.ecs_task_execution_managed`         |
|        | `aws_iam_role_policy_attachment.ecs_task_execution_policy`          |
|        | `module.superset-redis.aws_elasticache_cluster.default`             |
|        | `module.superset-redis.aws_elasticache_subnet_group.default`        |
|        | `module.superset-redis.aws_security_group.default`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ssm_parameters" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetWeblateSSMParameters"
        }
    }

  # aws_cloudwatch_log_group.superset will be destroyed
  # (because aws_cloudwatch_log_group.superset is not in configuration)
  - resource "aws_cloudwatch_log_group" "superset" {
      - arn               = "arn:aws:logs:ca-central-1:066023111852:log-group:/ecs/superset" -> null
      - id                = "/ecs/superset" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/superset" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_ecs_cluster.superset will be destroyed
  # (because aws_ecs_cluster.superset is not in configuration)
  - resource "aws_ecs_cluster" "superset" {
      - arn      = "arn:aws:ecs:ca-central-1:066023111852:cluster/superset" -> null
      - id       = "arn:aws:ecs:ca-central-1:066023111852:cluster/superset" -> null
      - name     = "superset" -> null
      - tags     = {
          - "Terraform" = "true"
        } -> null
      - tags_all = {
          - "Terraform" = "true"
        } -> null

      - configuration {
          - execute_command_configuration {
              - logging = "DEFAULT" -> null
            }
        }

      - service_connect_defaults {
          - namespace = "arn:aws:servicediscovery:ca-central-1:066023111852:namespace/ns-2r7s22kaw2leegk7" -> null
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_ecs_service.superset_image will be destroyed
  # (because aws_ecs_service.superset_image is not in configuration)
  - resource "aws_ecs_service" "superset_image" {
      - cluster                            = "arn:aws:ecs:ca-central-1:066023111852:cluster/superset" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset" -> null
      - name                               = "superset" -> null
      - platform_version                   = "1.4.0" -> null
      - propagate_tags                     = "SERVICE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - tags_all                           = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-image:3" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - capacity_provider_strategy {
          - base              = 0 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 1 -> null
        }

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-038e16631d49d3f69",
            ] -> null
          - subnets          = [
              - "subnet-09fbcf711c8abc44c",
              - "subnet-0b910474dd8b7ce8f",
            ] -> null
        }
    }

  # aws_ecs_task_definition.superset_image will be destroyed
  # (because aws_ecs_task_definition.superset_image is not in configuration)
  - resource "aws_ecs_task_definition" "superset_image" {
      - arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-image:3" -> null
      - arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-image" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "SUPERSET_SECRET_KEY"
                          - value = "foo"
                        },
                    ]
                  - essential        = true
                  - image            = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/superset"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "superset-image"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "1024" -> null
      - execution_role_arn       = "arn:aws:iam::066023111852:role/superset_task_execution_role" -> null
      - family                   = "superset-image" -> null
      - id                       = "superset-image" -> null
      - memory                   = "8192" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 3 -> null
      - skip_destroy             = false -> null
      - tags                     = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "cds-superset-prod"
          - "Terraform"  = "true"
        } -> null
      - task_role_arn            = "arn:aws:iam::066023111852:role/superset_task_role" -> null
    }

  # aws_iam_policy.superset_task_execution_policy will be destroyed
  # (because aws_iam_policy.superset_task_execution_policy is not in configuration)
  - resource "aws_iam_policy" "superset_task_execution_policy" {
      - arn         = "arn:aws:iam::066023111852:policy/superset_task_execution_policy" -> null
      - description = "Policy for superset task execution" -> null
      - id          = "arn:aws:iam::066023111852:policy/superset_task_execution_policy" -> null
      - name        = "superset_task_execution_policy" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:066023111852:log-group:/ecs/superset:*"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:066023111852:repository/superset"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAQ6X2IXSWIG2R56MCH" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # aws_iam_role.superset_task_execution_role will be destroyed
  # (because aws_iam_role.superset_task_execution_role is not in configuration)
  - resource "aws_iam_role" "superset_task_execution_role" {
      - arn                   = "arn:aws:iam::066023111852:role/superset_task_execution_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-01-04T18:45:07Z" -> null
      - force_detach_policies = false -> null
      - id                    = "superset_task_execution_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::066023111852:policy/superset_task_execution_policy",
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "superset_task_execution_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQ6X2IXSWDS3KAHV72" -> null
    }

  # aws_iam_role.superset_task_role will be destroyed
  # (because aws_iam_role.superset_task_role is not in configuration)
  - resource "aws_iam_role" "superset_task_role" {
      - arn                   = "arn:aws:iam::066023111852:role/superset_task_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-01-04T18:37:55Z" -> null
      - force_detach_policies = false -> null
      - id                    = "superset_task_role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "superset_task_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQ6X2IXSWD6YY46KNG" -> null
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_managed will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution_managed is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_execution_managed" {
      - id         = "superset_task_execution_role-20240104184507277500000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "superset_task_execution_role" -> null
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_policy will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_execution_policy" {
      - id         = "superset_task_execution_role-20240104184507275500000001" -> null
      - policy_arn = "arn:aws:iam::066023111852:policy/superset_task_execution_policy" -> null
      - role       = "superset_task_execution_role" -> null
    }

  # aws_ssm_parameter.superset_secret_key will be created
  + resource "aws_ssm_parameter" "superset_secret_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "superset_secret_key"
      + tags           = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.superset-redis.aws_elasticache_cluster.default will be destroyed
  # (because aws_elasticache_cluster.default is not in configuration)
  - resource "aws_elasticache_cluster" "default" {
      - arn                        = "arn:aws:elasticache:ca-central-1:066023111852:cluster:cds-redis" -> null
      - auto_minor_version_upgrade = "true" -> null
      - availability_zone          = "ca-central-1a" -> null
      - az_mode                    = "single-az" -> null
      - cache_nodes                = [
          - {
              - address           = "cds-redis.m4q4yy.0001.cac1.cache.amazonaws.com"
              - availability_zone = "ca-central-1a"
              - id                = "0001"
              - outpost_arn       = ""
              - port              = 6379
            },
        ] -> null
      - cluster_id                 = "cds-redis" -> null
      - engine                     = "redis" -> null
      - engine_version             = "7.1" -> null
      - engine_version_actual      = "7.1.0" -> null
      - id                         = "cds-redis" -> null
      - ip_discovery               = "ipv4" -> null
      - maintenance_window         = "sat:00:30-sat:01:30" -> null
      - network_type               = "ipv4" -> null
      - node_type                  = "cache.t2.micro" -> null
      - num_cache_nodes            = 1 -> null
      - parameter_group_name       = "default.redis7" -> null
      - port                       = 6379 -> null
      - security_group_ids         = [
          - "sg-0241b2fbad6071b33",
        ] -> null
      - snapshot_retention_limit   = 0 -> null
      - snapshot_window            = "06:00-07:00" -> null
      - subnet_group_name          = "cds-redis-subnet-grp" -> null
      - tags                       = {
          - "CostCentre" = "cds-superset-prod"
          - "Name"       = "cds-cluster"
          - "Terraform"  = "true"
          - "module"     = "elastic-cache"
        } -> null
      - tags_all                   = {
          - "CostCentre" = "cds-superset-prod"
          - "Name"       = "cds-cluster"
          - "Terraform"  = "true"
          - "module"     = "elastic-cache"
        } -> null
      - transit_encryption_enabled = false -> null
    }

  # module.superset-redis.aws_elasticache_subnet_group.default will be destroyed
  # (because aws_elasticache_subnet_group.default is not in configuration)
  - resource "aws_elasticache_subnet_group" "default" {
      - arn         = "arn:aws:elasticache:ca-central-1:066023111852:subnetgroup:cds-redis-subnet-grp" -> null
      - description = "Managed by Terraform" -> null
      - id          = "cds-redis-subnet-grp" -> null
      - name        = "cds-redis-subnet-grp" -> null
      - subnet_ids  = [
          - "subnet-09fbcf711c8abc44c",
          - "subnet-0b910474dd8b7ce8f",
        ] -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # module.superset-redis.aws_security_group.default will be destroyed
  # (because aws_security_group.default is not in configuration)
  - resource "aws_security_group" "default" {
      - arn                    = "arn:aws:ec2:ca-central-1:066023111852:security-group/sg-0241b2fbad6071b33" -> null
      - description            = "Default redis security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0241b2fbad6071b33" -> null
      - ingress                = [] -> null
      - name                   = "cds-redis-sg" -> null
      - owner_id               = "066023111852" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "CostCentre" = "cds-superset-prod"
          - "Name"       = "cds-sg"
          - "Terraform"  = "true"
          - "module"     = "elastic-cache"
        } -> null
      - tags_all               = {
          - "CostCentre" = "cds-superset-prod"
          - "Name"       = "cds-sg"
          - "Terraform"  = "true"
          - "module"     = "elastic-cache"
        } -> null
      - vpc_id                 = "vpc-0010287ba1021cc5c" -> null
    }

  # module.superset_ecs.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.superset_ecs.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.superset_ecs.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/superset"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # module.superset_ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "superset"
      + tags     = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.superset_ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "superset"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.superset_ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "superset"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-038e16631d49d3f69",
            ]
          + subnets          = [
              + "subnet-09fbcf711c8abc44c",
              + "subnet-0b910474dd8b7ce8f",
            ]
        }
    }

  # module.superset_ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "superset"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.superset_ecs.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "superset_ecs_task_exec_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
    }

  # module.superset_ecs.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "superset_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.superset_ecs.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "superset_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-superset-prod"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.superset_ecs.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "superset_ecs_task_exec_role"
    }

Plan: 10 to add, 0 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
